app/controllers/bike_routes_controller.rb

		# Array to store the final route result, add the origin to it to begin with
		route = [[start_lat, start_long]]
		# Get all the mid points from the database
		mid_points = MidPoint.all
---
SELECT "mid_points".* FROM "mid_points"

			end

			# Get all mid points in the bike path which contains the closest mid point
			mid_point = MidPoint.find_by mid_lat: closest_lat, mid_long: closest_long
---
SELECT  "mid_points".* FROM "mid_points"  WHERE "mid_points"."mid_lat" = -37.81695457 AND "mid_points"."mid_long" = 144.96163845 LIMIT 1