app/models/bike_route.rb

			end

			# Get all mid points in the bike path which contain the closest mid point
			mid_point = MidPoint.find_by mid_lat: closest_latlong[0], mid_long: closest_latlong[1]
			bike_path = mid_point.bike_routes.first.mid_points
---
SELECT  "mid_points".* FROM "mid_points"  WHERE "mid_points"."mid_lat" = -37.81695457 AND "mid_points"."mid_long" = 144.96163845 LIMIT 1
SELECT "mid_points".* FROM "mid_points"

	def self.get_points_in_range(start_lat, start_long, end_lat, end_long)
		# Get the differences of the latitudes and longitudes
		lat_diff = start_lat - end_lat
		long_diff = start_long - end_long
		# Margin is an amount to add to the search area so as to catch possible useful paths that may not be directly in range, set to approx 500 metres
		margin = 500000
		# Generate the grid around the origin
		eastern_border = start_long + long_diff.abs + margin
		western_border = start_long - long_diff.abs - margin
		northern_border = start_lat + lat_diff.abs + margin
		southern_border = start_lat - lat_diff.abs - margin
		# Array to store the mid points in range
		points_in_range = []
		# Get all the mid points from the database
		mid_points = MidPoint.all
		# Select the mid_points in range and add them to the points_in_range array
		mid_points.each do |mid_point|
---
SELECT "mid_points".* FROM "mid_points"